Examples/HartmannProblem/LESbase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


Uinlet          (Uin_var 0 0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (Uin_var 0 0);

boundaryField
{
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform $Uinlet;
    }
    inlet
    {
		type            fixedValue;
        value           uniform $Uinlet;
    }
    ".*"
    {
        type            noSlip;
    }
}


// ************************************************************************* //
